Autodesk.Revit.DB.Electrical.WireConduitTypeSet
A set that contains conduit types.

Autodesk.Revit.DB.Electrical.WireConduitTypeSet.Insert(Autodesk.Revit.DB.Electrical.WireConduitType)
System.Int32
Insert the specified conduit type into the set.
item: The conduit type to be inserted into the set.
Returns: Returns whether the conduit type was inserted into the set.

Autodesk.Revit.DB.Electrical.WireConduitTypeSet.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.Electrical.WireConduitTypeSet.ReverseIterator
Autodesk.Revit.DB.Electrical.WireConduitTypeSetIterator
Retrieve a backward moving iterator to the set.
Returns: Returns a backward moving iterator to the set.

Autodesk.Revit.DB.Electrical.WireConduitTypeSet.ForwardIterator
Autodesk.Revit.DB.Electrical.WireConduitTypeSetIterator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.Electrical.WireConduitTypeSet.Erase(Autodesk.Revit.DB.Electrical.WireConduitType)
System.Int32
Removes a specified conduit type from the set.
item: The conduit type to be erased.
Returns: The number of conduit types that were erased from the set.

Autodesk.Revit.DB.Electrical.WireConduitTypeSet.Contains(Autodesk.Revit.DB.Electrical.WireConduitType)
System.Boolean
Tests for the existence of a conduit type within the set.
item: The conduit type to be searched for.
Returns: The Contains method returns True if the conduit type is within the set, otherwise False.

Autodesk.Revit.DB.Electrical.WireConduitTypeSet.Clear
void
Removes every conduit type from the set, rendering it empty.

Autodesk.Revit.DB.Electrical.WireConduitTypeSet.Size
System.Int32
get
Returns the number of conduit types that are in the set.

Autodesk.Revit.DB.Electrical.WireConduitTypeSet.IsEmpty
System.Boolean
get
Test to see if the set is empty.
Remarks: If the set is empty then True will be returned, otherwise False.